
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>基础内容 · Swift 编程语言</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="modnarshen">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-cuav-chapters/cuav-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-canyon/canyon.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../LanguageReference/" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
	<div class="header-inner">
		<!-- LOGO -->
		<div class="logo"></div>
		<span class="title"></span>

		<!-- Search -->
		
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>


		<!-- Nav -->
		<ul class="header-nav">
			
		</ul>
	</div>

	<div class="book-summary">
		<div class="book-summary-title">目录</div>
		
		
		<nav role="navigation">
			


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../WelcomeToSwift/">
            
                <a href="../WelcomeToSwift/">
            
                    
                    欢迎
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../WelcomeToSwift/AboutSwift.html">
            
                <a href="../WelcomeToSwift/AboutSwift.html">
            
                    
                    关于 Swift
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../WelcomeToSwift/VersionCompatibility.html">
            
                <a href="../WelcomeToSwift/VersionCompatibility.html">
            
                    
                    版本适配
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../WelcomeToSwift/ASwiftTour.html">
            
                <a href="../WelcomeToSwift/ASwiftTour.html">
            
                    
                    Swift 之旅
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../WelcomeToSwift/TranslatorNote.html">
            
                <a href="../WelcomeToSwift/TranslatorNote.html">
            
                    
                    译者注
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="./">
            
                <a href="./">
            
                    
                    语法教程
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="TheBasics.html">
            
                <a href="TheBasics.html">
            
                    
                    基础内容
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../LanguageReference/">
            
                <a href="../LanguageReference/">
            
                    
                    参考引用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../RevisionHistory/">
            
                <a href="../RevisionHistory/">
            
                    
                    修订历史
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


		</nav>
		
		
	</div>

	<!-- Content nav -->
	<div class="book-anchor">
		<div class="book-anchor-title">访达:</div>
		<div class="book-anchor-body">

		</div>
	</div>

	<div class="book-body">
		
		<div class="body-inner">
			
			

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >基础内容</a>
    </h1>
</div>




			<div class="page-wrapper" tabindex="-1" role="main">
				<div class="page-inner">
					
<div id="book-search-results">
    <div class="search-noresults">
    
					<section class="normal markdown-section">
						
						<h1 id="&#x57FA;&#x7840;&#x5185;&#x5BB9;">&#x57FA;&#x7840;&#x5185;&#x5BB9;</h1>
<p>&#xA0; &#xA0; &#xA0; &#xA0; Swift &#x662F;&#x4E00;&#x6B3E;&#x5E94;&#x7528;&#x4E8E; iOS &#xFF0C; macOS &#xFF0C;watchOS &#x4EE5;&#x53CA; tvOS &#x5E94;&#x7528;&#x5F00;&#x53D1;&#x7684;&#x5168;&#x65B0;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x5B9A;&#x7684; C &#x8BED;&#x8A00;&#x6216; Objective-C &#x7684;&#x5F00;&#x53D1;&#x7ECF;&#x9A8C;&#xFF0C;&#x4F60;&#x4E5F;&#x4F1A;&#x611F;&#x53D7;&#x5230; Swift &#x7684;&#x8BF8;&#x591A;&#x90E8;&#x5206;&#x90FD;&#x975E;&#x5E38;&#x719F;&#x6089;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5BF9;&#x4E8E;&#x6240;&#x6709; C&#x3001;Objective-C &#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;Swift &#x90FD;&#x63D0;&#x4F9B;&#x4E86;&#x81EA;&#x5DF1;&#x72EC;&#x7ACB;&#x7684;&#x5B9E;&#x73B0;&#x7248;&#x672C;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x9002;&#x7528;&#x4E8E;&#x6574;&#x6570;&#x578B;&#x7684; <code>Int</code>&#x3001;&#x9002;&#x7528;&#x4E8E;&#x6D6E;&#x70B9;&#x6570;&#x7C7B;&#x578B;&#x7684; <code>Double</code> &#x548C; <code>Float</code>&#x3001;&#x9002;&#x7528;&#x4E8E;&#x5E03;&#x5C14;&#x503C;&#x7C7B;&#x578B;&#x7684; <code>Bool</code> &#x4EE5;&#x53CA;&#x9002;&#x7528;&#x4E8E;&#x6587;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684; <code>String</code>&#x3002; Swift &#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x652F;&#x6301; <code>Array</code>&#x3001;<code>Set</code> &#x4EE5;&#x53CA; <code>Dictionary</code> &#x4E09;&#x79CD;&#x96C6;&#x5408;&#x7C7B;&#x578B;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#x7684;&#x5B9E;&#x73B0;&#x7248;&#x672C;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x53EF;&#x4EE5;&#x53C2;&#x8003; <a href="CollectionTypes.md">&#x96C6;&#x5408;&#x7C7B;&#x578B;</a>&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4E0E; C &#x8BED;&#x8A00;&#x4E00;&#x6837;&#xFF0C; Swift &#x4E5F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x53EF;&#x901A;&#x8FC7;&#x6807;&#x8BC6;&#x7B26;&#x540D;&#x5B57;&#x6765;&#x5F15;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x503C;&#x3002; Swift &#x4E5F;&#x9488;&#x5BF9;&#x90A3;&#x4E9B;&#x6570;&#x503C;&#x4E0D;&#x53EF;&#x66F4;&#x6539;&#x7684;&#x53D8;&#x91CF;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x5E38;&#x91CF;&#xFF09;&#x521B;&#x5EFA;&#x4E86;&#x5F88;&#x591A;&#x9644;&#x5E26;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4F7F;&#x5F97;&#x5B83;&#x6BD4; C &#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5E38;&#x91CF;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#x3002;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x90A3;&#x4E9B;&#x65E0;&#x9700;&#x66F4;&#x6539;&#x7684;&#x6570;&#x503C;&#x65F6;&#xFF0C;&#x4F7F;&#x7528; Swift &#x4E2D;&#x7684;&#x5E38;&#x91CF;&#x53EF;&#x4EE5;&#x8BA9;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x5B89;&#x5168;&#x3001;&#x903B;&#x8F91;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x9664;&#x4E86;&#x719F;&#x6089;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5916;&#xFF0C; Swift &#x8FD8;&#x63D0;&#x4F9B;&#x4E86; Objective-C &#x5F53;&#x4E2D;&#x6CA1;&#x6709;&#x7684;&#x9AD8;&#x7EA7;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x6BD4;&#x5982;&#x5143;&#x7EC4;&#x3002;&#x5143;&#x7EC4;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x521B;&#x5EFA;&#x53CA;&#x4F20;&#x9012;&#x4E00;&#x7EC4;&#x6570;&#x503C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5F88;&#x81EA;&#x7136;&#x5730;&#x4F7F;&#x7528;&#x5143;&#x7EC4;&#x6765;&#x8BA9;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x591A;&#x79CD;&#x7C7B;&#x578B;&#x6570;&#x503C;&#xFF0C;&#x800C;&#x8FD9;&#x7EC4;&#x6570;&#x503C;&#x672C;&#x8EAB;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x79CD;&#x6DF7;&#x5408;&#x7684;&#x6570;&#x503C;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; Swift &#x4E5F;&#x5F15;&#x5165;&#x4E86;&#x53EF;&#x9009;&#x503C;&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x5904;&#x7406;&#x6570;&#x503C;&#x7F3A;&#x5931;&#x7684;&#x573A;&#x666F;&#x3002;&#x53EF;&#x9009;&#x503C;&#x8868;&#x793A;&#xFF0C;&#x8981;&#x4E48; <strong>&#x5B83;&#x62E5;&#x6709;&#x5B9E;&#x9645;&#x7684;&#x6570;&#x503C;&#x5E76;&#x4E14;&#x8FD9;&#x4E2A;&#x503C;&#x5C31;&#x662F; x</strong> &#xFF0C;&#x8981;&#x4E48; <strong>&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x503C;</strong> &#x3002;&#x53EF;&#x9009;&#x503C;&#x7528;&#x8D77;&#x6765;&#x548C; Objective-C &#x4E2D;&#x53EF;&#x80FD;&#x4E3A; <code>nil</code> &#x7684;&#x6307;&#x9488;&#x5F88;&#x76F8;&#x50CF;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x5728; Swift &#x4E2D;&#x5374;&#x4E0D;&#x4EC5;&#x4EC5;&#x53EA;&#x9002;&#x7528;&#x4E8E;&#x7C7B;&#x3002;&#x5B83;&#x4E0D;&#x4EC5;&#x6BD4; Objective-C &#x4E2D;&#x7684; <code>nil</code> &#x6307;&#x9488;&#x66F4;&#x52A0;&#x5B89;&#x5168;&#x4EE5;&#x53CA;&#x62E5;&#x6709;&#x66F4;&#x597D;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x4E5F;&#x662F; Swift &#x8BF8;&#x591A;&#x5F3A;&#x5927;&#x7279;&#x6027;&#x7684;&#x6838;&#x5FC3;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; Swift &#x662F;&#x4E00;&#x95E8; <strong>&#x7C7B;&#x578B;&#x5B89;&#x5168;</strong> &#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x8868;&#x660E;&#x5B83;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4F60;&#x6E05;&#x6670;&#x5730;&#x786E;&#x5B9A;&#x4F60;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4EE3;&#x7801;&#x4E2D;&#x9700;&#x8981;&#x4F7F;&#x7528; <code>String</code> &#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x5C31;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x4F60;&#x4E0D;&#x4F1A;&#x9519;&#x8BEF;&#x5730;&#x4F20;&#x9012;&#x7ED9;&#x5B83;&#x4E00;&#x4E2A; <code>Int</code> &#x503C;&#x3002;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x4E5F;&#x786E;&#x4FDD;&#x4F60;&#x4E0D;&#x4F1A;&#x9519;&#x8BEF;&#x5730;&#x7ED9;&#x4E00;&#x4E2A;&#x975E;&#x53EF;&#x9009;&#x503C;&#x7684; <code>String</code> &#x53D8;&#x91CF;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A; <code>String</code> &#x53EF;&#x9009;&#x503C;&#x3002;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x4F7F;&#x5F97;&#x4F60;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x4EE5;&#x5C3D;&#x65E9;&#x5730;&#x66B4;&#x9732;&#x5E76;&#x89E3;&#x51B3;&#x9519;&#x8BEF;&#x3002;</p>
<h2 id="&#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;">&#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;</h2>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;&#x901A;&#x5E38;&#x4E0E;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x6307;&#x5B9A;&#x7C7B;&#x578B;&#xFF08;&#x6BD4;&#x5982;&#x6570;&#x503C; <code>10</code> &#x4EE5;&#x53CA;&#x5B57;&#x7B26;&#x4E32; <code>&quot;Hello&quot;</code>&#xFF09;&#x7684;&#x547D;&#x540D;&#xFF08;&#x6BD4;&#x5982; <code>maximumNumberOfLoginAttempts</code> &#x4EE5;&#x53CA; <code>welcomeMessage</code> &#xFF09;&#x76F8;&#x5173;&#x8054;&#x3002;&#x5BF9;&#x4E8E; <strong>&#x5E38;&#x91CF;</strong> &#x800C;&#x8A00;&#xFF0C;&#x5B83;&#x7684;&#x503C;&#x4E00;&#x65E6;&#x88AB;&#x8BBE;&#x5B9A;&#x5C31;&#x4E0D;&#x53EF;&#x66F4;&#x6539;&#xFF0C;&#x800C; <strong>&#x53D8;&#x91CF;</strong> &#x7684;&#x503C;&#x5374;&#x53EF;&#x4EE5;&#x5728;&#x540E;&#x9762;&#x7EE7;&#x7EED;&#x88AB;&#x4FEE;&#x6539;&#x3002;</p>
<h3 id="&#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;&#x7684;&#x58F0;&#x660E;">&#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;&#x7684;&#x58F0;&#x660E;</h3>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5728;&#x4F7F;&#x7528;&#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x5148;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x58F0;&#x660E;&#x3002;&#x5BF9;&#x4E8E;&#x5E38;&#x91CF;&#xFF0C;&#x4F7F;&#x7528; <code>let</code> &#x5173;&#x952E;&#x5B57;&#x6765;&#x58F0;&#x660E;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x53D8;&#x91CF;&#xFF0C;&#x5219;&#x4F7F;&#x7528; <code>var</code> &#x5173;&#x952E;&#x5B57;&#x6765;&#x8FDB;&#x884C;&#x58F0;&#x660E;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x7406;&#x89E3;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;&#x6765;&#x8BB0;&#x5F55;&#x7528;&#x6237;&#x5C1D;&#x8BD5;&#x767B;&#x5F55;&#x7684;&#x6B21;&#x6570;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> maximumNumberOfLoginAttempts = <span class="hljs-number">10</span>
<span class="hljs-keyword">var</span> currentLoginAttempt = <span class="hljs-number">0</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5BF9;&#x4E8E;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x5B83;&#x7684;&#x6DB5;&#x4E49;&#x5C31;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#xFF1A;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x201C;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; <code>maximumNumberOfLoginAttempts</code> &#x7684;&#x5E38;&#x91CF;&#x5E76;&#x4E3A;&#x5176;&#x8D4B;&#x4E88;&#x521D;&#x59CB;&#x503C; <code>10</code> &#x3002;&#x7136;&#x540E;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; <code>currentLoginAttempt</code> &#x7684;&#x53D8;&#x91CF;&#x5E76;&#x4E3A;&#x5176;&#x8D4B;&#x4E88;&#x521D;&#x59CB;&#x503C; <code>0</code>&#x201D;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5728;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x5C06;&#x5141;&#x8BB8;&#x5C1D;&#x8BD5;&#x767B;&#x5F55;&#x7684;&#x6700;&#x5927;&#x6B21;&#x6570;&#x58F0;&#x660E;&#x4E3A;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x503C;&#x662F;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x53D8;&#x7684;&#x3002;&#x800C;&#x5C06;&#x5F53;&#x524D;&#x5C1D;&#x8BD5;&#x767B;&#x5F55;&#x7684;&#x6B21;&#x6570;&#x58F0;&#x660E;&#x4E3A;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x6BCF;&#x6B21;&#x767B;&#x5F55;&#x5931;&#x8D25;&#x65F6;&#x90FD;&#x8981;&#x589E;&#x52A0;&#x8FD9;&#x4E2A;&#x5C1D;&#x8BD5;&#x767B;&#x5F55;&#x6B21;&#x6570;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9017;&#x53F7;&#x5206;&#x9694;&#x6765;&#x5B9E;&#x73B0;&#x4E00;&#x884C;&#x5185;&#x58F0;&#x660E;&#x591A;&#x4E2A;&#x53D8;&#x91CF;&#x6216;&#x5E38;&#x91CF;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">var</span> x = <span class="hljs-number">0.0</span>, y = <span class="hljs-number">0.0</span>, z = <span class="hljs-number">0.0</span>
</code></pre>
<blockquote>
<p><em><strong>&#x8BF4;&#x660E;</strong></em></p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5982;&#x679C;&#x8BB0;&#x5F55;&#x7684;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x5C31;&#x4F7F;&#x7528; <code>let</code> &#x5173;&#x952E;&#x5B57;&#x6765;&#x5C06;&#x5176;&#x58F0;&#x660E;&#x4E3A;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#x3002;&#x53EA;&#x5BF9;&#x90A3;&#x4E9B;&#x9700;&#x8981;&#x88AB;&#x4FEE;&#x6539;&#x7684;&#x6570;&#x503C;&#x58F0;&#x660E;&#x4E3A;&#x53D8;&#x91CF;&#x3002;</p>
</blockquote>
<h3 id="&#x7C7B;&#x578B;&#x58F0;&#x660E;">&#x7C7B;&#x578B;&#x58F0;&#x660E;</h3>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5F53;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#xFF08;&#x6216;&#x53D8;&#x91CF;&#xFF09;&#x65F6;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x663E;&#x5F0F;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A; <strong>&#x7C7B;&#x578B;&#x58F0;&#x660E;</strong> &#x6765;&#x66F4;&#x6E05;&#x695A;&#x5730;&#x8BF4;&#x660E;&#x8FD9;&#x4E2A;&#x5E38;&#x91CF;&#xFF08;&#x6216;&#x53D8;&#x91CF;&#xFF09;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x7684;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x53EA;&#x9700;&#x8981;&#x5728;&#x5E38;&#x91CF;&#xFF08;&#x53D8;&#x91CF;&#xFF09;&#x540D;&#x79F0;&#x540E;&#x9762;&#x8DDF;&#x4E00;&#x4E2A;&#x5192;&#x53F7;&#x3001;&#x7A7A;&#x683C;&#x4EE5;&#x53CA;&#x6570;&#x503C;&#x7C7B;&#x578B;&#x540D;&#x5373;&#x53EF;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">var</span> welcomeMessage: <span class="hljs-type">String</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6B64;&#x5904;&#x58F0;&#x660E;&#x4E2D;&#x5206;&#x53F7;&#x7684;&#x6DB5;&#x4E49;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F; &#x201C; ... &#x7684;&#x7C7B;&#x578B;&#x662F; ... &#x201D;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x884C;&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#xFF1A;&#x201C;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; <code>welcomeMessage</code> &#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x662F; <code>String</code> &#x7C7B;&#x578B;&#x201D;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x201C;&#x7C7B;&#x578B;&#x662F; <code>String</code> &#x7C7B;&#x578B;&#x201D;&#xFF0C;&#x6307;&#x7684;&#x662F; &#x201C;&#x5B83;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x4EFB;&#x610F; <code>String</code> &#x7C7B;&#x578B;&#x7684;&#x503C;&#x201D;&#x3002;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x7406;&#x89E3;&#x4E3A;&#x53EF;&#x4EE5;&#x88AB;&#x5B58;&#x50A8;&#x7684;&#x201C;&#x67D0;&#x7269;&#x7684;&#x7C7B;&#x578B;&#x201D;&#xFF08;&#x6216;&#x201C;&#x67D0;&#x7269;&#x7684;&#x79CD;&#x7C7B;&#x201D;&#xFF09;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6B64;&#x65F6;&#x7684; <code>welcomeMessage</code> &#x53D8;&#x91CF;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x8D4B;&#x4E88;&#x4EFB;&#x610F;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x503C;&#x800C;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#xFF1A;</p>
<pre><code class="lang-swift">welcomeMessage = <span class="hljs-string">&quot;Hello&quot;</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x884C;&#x5185;&#x58F0;&#x660E;&#x591A;&#x4E2A;&#x62E5;&#x6709;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x4EC5;&#x9700;&#x8981;&#x7528;&#x9017;&#x53F7;&#x5C06;&#x5B83;&#x4EEC;&#x5206;&#x9694;&#xFF0C;&#x5E76;&#x5728;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x540D;&#x540E;&#x6307;&#x5B9A;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">var</span> red, green, blue: <span class="hljs-type">Double</span>
</code></pre>
<blockquote>
<p><em><strong>&#x8BF4;&#x660E;</strong></em></p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5728;&#x5B9E;&#x9645;&#x7EC3;&#x4E60;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x51E0;&#x4E4E;&#x4E0D;&#x4F1A;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x8FDB;&#x884C;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#x3002;&#x5982;&#x679C;&#x5728;&#x5B9A;&#x4E49;&#x5E38;&#x91CF;&#xFF08;&#x6216;&#x53D8;&#x91CF;&#xFF09;&#x65F6;&#x63D0;&#x4F9B;&#x4E86;&#x521D;&#x59CB;&#x503C;&#xFF0C;&#x90A3;&#x4E48; Swift &#x5C31;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x521D;&#x59CB;&#x503C;&#x6765;&#x63A8;&#x5BFC;&#x51FA;&#x53D8;&#x91CF;&#xFF08;&#x6216;&#x5E38;&#x91CF;&#xFF09;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x53EF;&#x8BE6;&#x89C1; <a href="#&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x4E0E;&#x7C7B;&#x578B;&#x63A8;&#x5BFC;">&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x4E0E;&#x7C7B;&#x578B;&#x63A8;&#x5BFC;</a>&#x3002;&#x5728;&#x4E0A;&#x9762; <code>welcomeMessage</code> &#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x4E3A;&#x5B83;&#x6307;&#x5B9A;&#x521D;&#x59CB;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x521D;&#x59CB;&#x503C;&#x6765;&#x63A8;&#x5BFC;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x8FDB;&#x800C;&#x5C31;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#x6765;&#x663E;&#x5F0F;&#x6307;&#x5B9A;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x3002;</p>
</blockquote>
<h3 id="&#x4E3A;&#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;&#x547D;&#x540D;">&#x4E3A;&#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;&#x547D;&#x540D;</h3>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5305;&#x62EC; Unicode &#x7F16;&#x7801;&#x5728;&#x5185;&#x7684;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5B57;&#x7B26;&#x6765;&#x4E3A;&#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;&#x547D;&#x540D;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> &#x3C0; = <span class="hljs-number">3.14159</span>
<span class="hljs-keyword">let</span> &#x4F60;&#x597D; = <span class="hljs-string">&quot;&#x4F60;&#x597D;&#x4E16;&#x754C;&quot;</span>
<span class="hljs-keyword">let</span> &#x1F436;&#x1F42E; = <span class="hljs-string">&quot;dogcow&quot;</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5E38;&#x91CF;&#x540D;&#xFF08;&#x4E0E;&#x53D8;&#x91CF;&#x540D;&#xFF09;&#x4E0D;&#x80FD;&#x5305;&#x542B;&#x7A7A;&#x683C;&#x7B26;&#x3001;&#x6570;&#x5B66;&#x7B26;&#x53F7;&#x3001;&#x7BAD;&#x5934;&#x3001; Unicode &#x4E13;&#x7528;&#x6807;&#x91CF;&#x503C;&#xFF0C;&#x6216;&#x5212;&#x7EBF;&#x3001;&#x65B9;&#x6846;&#x7ED8;&#x5236;&#x7684;&#x5B57;&#x7B26;&#x3002;&#x547D;&#x540D;&#x7684;&#x8D77;&#x59CB;&#x90E8;&#x5206;&#x4E0D;&#x80FD;&#x662F;&#x6570;&#x5B57;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x4F4D;&#x7F6E;&#x5219;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6570;&#x5B57;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4E00;&#x65E6;&#x4F60;&#x5DF2;&#x7ECF;&#x4E3A;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#xFF08;&#x6216;&#x53D8;&#x91CF;&#xFF09;&#x58F0;&#x660E;&#x4E86;&#x5177;&#x4F53;&#x7C7B;&#x578B;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x4E0D;&#x80FD;&#x518D;&#x7528;&#x76F8;&#x540C;&#x7684;&#x547D;&#x540D;&#x91CD;&#x590D;&#x5BF9;&#x5176;&#x58F0;&#x660E;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x5B83;&#x6240;&#x80FD;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x503C;&#x7C7B;&#x578B;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x8BA9;&#x53D8;&#x91CF;&#x53D8;&#x4E3A;&#x5E38;&#x91CF;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x8BA9;&#x5E38;&#x91CF;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x3002;</p>
<blockquote>
<p><em><strong>&#x8BF4;&#x660E;</strong></em></p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5982;&#x679C;&#x4F60;&#x60F3;&#x4F7F;&#x7528;&#x4E0E; Swift &#x5173;&#x952E;&#x5B57;&#x76F8;&#x540C;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x6765;&#x4E3A;&#x5E38;&#x91CF;&#xFF08;&#x6216;&#x53D8;&#x91CF;&#xFF09;&#x547D;&#x540D;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x547D;&#x540D;&#x4E24;&#x4FA7;&#x52A0;&#x53CD;&#x5F15;&#x53F7;&#xFF08; ` &#xFF09;&#x6765;&#x8FBE;&#x5230;&#x76EE;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x522B;&#x65E0;&#x9009;&#x62E9;&#xFF0C;&#x5426;&#x5219;&#x52A1;&#x5FC5;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x4E0E;&#x5173;&#x952E;&#x5B57;&#x76F8;&#x540C;&#x7684;&#x547D;&#x540D;&#x3002;</p>
</blockquote>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x9002;&#x5F53;&#x7C7B;&#x578B;&#x7684;&#x65B0;&#x503C;&#x6765;&#x4E3A;&#x5176;&#x8D4B;&#x503C;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C; <code>friendlyWelcome</code> &#x7684;&#x503C;&#x5C31;&#x4ECE; <code>&quot;Hello&quot;</code> &#x53D8;&#x6210;&#x4E86; <code>&quot;Bonjour!&quot;</code> &#x3002;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">var</span> friendlyWelcome = <span class="hljs-string">&quot;Hello!&quot;</span>
friendlyWelcome = <span class="hljs-string">&quot;Bonjour!&quot;</span>
<span class="hljs-comment">// friendlyWelcome &#x73B0;&#x5728;&#x7684;&#x503C;&#x5DF2;&#x7ECF;&#x662F; &quot;Bonjour!&quot;</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4E0E;&#x53D8;&#x91CF;&#x4E0D;&#x540C;&#xFF0C;&#x5E38;&#x91CF;&#x7684;&#x6570;&#x503C;&#x5728;&#x786E;&#x5B9A;&#x540E;&#x5C31;&#x4E0D;&#x53EF;&#x518D;&#x66F4;&#x6539;&#x3002;&#x5426;&#x5219;&#x7F16;&#x8BD1;&#x65F6;&#x4FEE;&#x6539;&#x5E38;&#x91CF;&#x6570;&#x503C;&#x7684;&#x4EE3;&#x7801;&#x5C06;&#x4F1A;&#x62A5;&#x9519;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> languageName = <span class="hljs-string">&quot;Swift&quot;</span>
languageName = <span class="hljs-string">&quot;Swift++&quot;</span>
<span class="hljs-comment">// &#x7F16;&#x8BD1;&#x65F6;&#x62A5;&#x9519;&#xFF1A; languageName &#x4E0D;&#x53EF;&#x88AB;&#x66F4;&#x6539;</span>
</code></pre>
<h3 id="&#x6253;&#x5370;&#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;">&#x6253;&#x5370;&#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;</h3>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4F7F;&#x7528; <code>print(_:separator:terminator:)</code> &#x51FD;&#x6570;&#x6765;&#x6253;&#x5370;&#x5E38;&#x91CF;&#xFF08;&#x6216;&#x53D8;&#x91CF;&#xFF09;&#x7684;&#x5F53;&#x524D;&#x503C;&#x3002;</p>
<pre><code class="lang-swift"><span class="hljs-built_in">print</span>(friendlyWelcome)
<span class="hljs-comment">// &#x6253;&#x5370;&#x51FA; &quot;Bonjour!&quot;</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; <code>print(_:separator:terminator:)</code> &#x51FD;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5C06;&#x82E5;&#x5E72;&#x4E2A;&#x6570;&#x503C;&#x6253;&#x5370;&#x8F93;&#x51FA;&#x5230;&#x5408;&#x9002;&#x7684;&#x8F93;&#x51FA;&#x6D41;&#x3002;&#x5728; Xcode &#x4E2D;&#xFF0C; <code>print(_:separator:terminator:)</code> &#x51FD;&#x6570;&#x5C31;&#x4F1A;&#x628A;&#x8F93;&#x51FA;&#x5185;&#x5BB9;&#x6253;&#x5370;&#x5230; Xcode &#x7684;&#x63A7;&#x5236;&#x53F0;&#x9762;&#x677F;&#x4E0A;&#x3002; <code>separator</code> &#x548C; <code>terminator</code> &#x53C2;&#x6570;&#x90FD;&#x62E5;&#x6709;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x4F60;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x65F6;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x5B83;&#x4EEC;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x51FD;&#x6570;&#x6253;&#x5370;&#x5B8C;&#x4E00;&#x884C;&#x5185;&#x5BB9;&#x4F1A;&#x8F93;&#x51FA;&#x6362;&#x884C;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x60F3;&#x8FD9;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A; <code>terminator</code> &#x53C2;&#x6570;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x2014;&#x2014; <code>print(someValue, terminator: &quot;&quot;)</code> &#x3002;&#x5173;&#x4E8E;&#x53C2;&#x6570;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x8BE6;&#x89C1; <a href="#&#x53C2;&#x6570;&#x9ED8;&#x8BA4;&#x503C;">&#x53C2;&#x6570;&#x9ED8;&#x8BA4;&#x503C;</a> &#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; Swift &#x652F;&#x6301; <strong>&#x5B57;&#x7B26;&#x4E32;&#x63D2;&#x503C;</strong> &#x2014;&#x2014; &#x5728;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x4F7F;&#x7528;&#x5E38;&#x91CF;&#x540D;&#xFF08;&#x53D8;&#x91CF;&#x540D;&#xFF09;&#x6765;&#x4F5C;&#x4E3A;&#x5360;&#x4F4D;&#x7B26;&#xFF0C;&#x6765;&#x63D2;&#x5165;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x5F53;&#x524D;&#x7684;&#x5B9E;&#x9645;&#x503C;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5728;&#x5E38;&#x91CF;&#x540D;&#xFF08;&#x53D8;&#x91CF;&#x540D;&#xFF09;&#x4E24;&#x4FA7;&#x7528;&#x5C0F;&#x62EC;&#x53F7;&#x754C;&#x5B9A;&#xFF0C;&#x5E76;&#x5728;&#x5DE6;&#x4FA7;&#x5C0F;&#x62EC;&#x53F7;&#x524D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x53CD;&#x659C;&#x6760;&#x5373;&#x53EF;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-built_in">print</span>(<span class="hljs-string">&quot;The current value of friendlyWelcome is <span class="hljs-subst">\(friendlyWelcome)</span>&quot;</span>)
<span class="hljs-comment">// &#x6253;&#x5370;&#x51FA; &quot;The current value of friendlyWelcome is Bonjour!&quot;</span>
</code></pre>
<blockquote>
<p><em><strong>&#x8BF4;&#x660E;</strong></em></p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5173;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#x63D2;&#x503C;&#x7684;&#x6240;&#x6709;&#x53EF;&#x7528;&#x7684;&#x9009;&#x9879;&#xFF0C;&#x8BE6;&#x89C1; <a href="#&#x5B57;&#x7B26;&#x4E32;&#x63D2;&#x503C;">&#x5B57;&#x7B26;&#x4E32;&#x63D2;&#x503C;</a> &#x3002;</p>
</blockquote>
<h2 id="&#x6CE8;&#x91CA;">&#x6CE8;&#x91CA;</h2>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6CE8;&#x91CA;&#x8868;&#x793A;&#x90A3;&#x4E9B;&#x4EE3;&#x7801;&#x4E2D;&#x4E00;&#x5B9A;&#x4E0D;&#x4F1A;&#x6267;&#x884C;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x7528;&#x4E8E;&#x8BF4;&#x660E;&#x4EE5;&#x53CA;&#x5907;&#x5FD8;&#x3002;&#x5F53;&#x7F16;&#x8BD1;&#x65F6;&#xFF0C;&#x6CE8;&#x91CA;&#x5C31;&#x4F1A;&#x88AB; Swift &#x5FFD;&#x7565;&#x6389;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; Swift &#x4E2D;&#x7684;&#x6CE8;&#x91CA;&#x4E0E; C &#x5F53;&#x4E2D;&#x7684;&#x6CE8;&#x91CA;&#x975E;&#x5E38;&#x76F8;&#x50CF;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x884C;&#x9996;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x659C;&#x6760;&#xFF08;<code>//</code>&#xFF09;&#xFF0C;&#x5C31;&#x8868;&#x793A;&#x8FD9;&#x4E00;&#x884C;&#x5185;&#x5BB9;&#x662F;&#x4E00;&#x884C;&#x6CE8;&#x91CA;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-comment">// &#x8FD9;&#x662F;&#x4E00;&#x884C;&#x6CE8;&#x91CA;</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x800C;&#x5BF9;&#x4E8E;&#x591A;&#x884C;&#x6CE8;&#x91CA;&#xFF0C;&#x4F7F;&#x7528;&#x659C;&#x6760;&#x4E0E;&#x661F;&#x53F7;&#x7EC4;&#x5408;&#xFF08;<code>/*</code>&#xFF09;&#x8868;&#x793A;&#x6CE8;&#x91CA;&#x5F00;&#x59CB;&#xFF0C;&#x4F7F;&#x7528;&#x661F;&#x53F7;&#x4E0E;&#x659C;&#x6760;&#x7EC4;&#x5408;&#xFF08;<code>*/</code>&#xFF09;&#x8868;&#x793A;&#x6CE8;&#x91CA;&#x7ED3;&#x675F;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-comment">/* &#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x884C;&#x6CE8;&#x91CA;
&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x5199;&#x5728;&#x591A;&#x884C; */</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4E0E; C &#x7684;&#x591A;&#x884C;&#x6CE8;&#x91CA;&#x4E0D;&#x540C;&#xFF0C;Swift &#x652F;&#x6301;&#x591A;&#x884C;&#x6CE8;&#x91CA;&#x7684;&#x5D4C;&#x5957;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x591A;&#x884C;&#x6CE8;&#x91CA;&#x5757;&#x4E2D;&#xFF0C;&#x53C8;&#x5199;&#x4E86;&#x7B2C;&#x4E8C;&#x4E2A;&#x6CE8;&#x91CA;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x6CE8;&#x91CA;&#x7ED3;&#x675F;&#x6807;&#x8BC6;&#x6765;&#x8BF4;&#xFF0C;&#x5148;&#x7ED3;&#x675F;&#x7684;&#x662F;&#x7B2C;&#x4E8C;&#x4E2A;&#x6CE8;&#x91CA;&#x5757;&#xFF0C;&#x518D;&#x7ED3;&#x675F;&#x7684;&#x624D;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x6CE8;&#x91CA;&#x5757;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-comment">/* &#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x591A;&#x884C;&#x6CE8;&#x91CA;&#x5757;&#x7684;&#x5F00;&#x59CB;
 <span class="hljs-comment">/* &#x8FD9;&#x662F;&#x7B2C;&#x4E8C;&#x4E2A;&#xFF0C;&#x4E5F;&#x662F;&#x5D4C;&#x5957;&#x7684;&#x6CE8;&#x91CA;&#x5757; */</span>
&#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x591A;&#x884C;&#x6CE8;&#x91CA;&#x5757;&#x7684;&#x7ED3;&#x675F; */</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6709;&#x4E86;&#x5D4C;&#x5957;&#x7684;&#x591A;&#x884C;&#x6CE8;&#x91CA;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;&#x6CE8;&#x91CA;&#x6389;&#x591A;&#x884C;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x4FBF;&#x6377;&#xFF0C;&#x5373;&#x4F7F;&#x6CE8;&#x91CA;&#x7684;&#x4EE3;&#x7801;&#x5DF2;&#x7ECF;&#x5305;&#x542B;&#x4E86;&#x591A;&#x884C;&#x6CE8;&#x91CA;&#x3002;</p>
<h2 id="&#x5206;&#x53F7;">&#x5206;&#x53F7;</h2>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4E0E;&#x5F88;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E0D;&#x540C;&#xFF0C;Swift &#x65E0;&#x9700;&#x5728;&#x6BCF;&#x884C;&#x4EE3;&#x7801;&#x672B;&#x5C3E;&#x6DFB;&#x52A0;&#x5206;&#x53F7;&#xFF08;;&#xFF09;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x663E;&#x5F0F;&#x6DFB;&#x52A0;&#x4E5F;&#x662F;&#x5141;&#x8BB8;&#x7684;&#x3002;&#x4F46;&#x5982;&#x679C;&#x60F3;&#x5728;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x4E2D;&#x4E66;&#x5199;&#x591A;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x90A3;&#x5206;&#x53F7;&#x5C31;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> cat = <span class="hljs-string">&quot;&#x1F431;&quot;</span>; <span class="hljs-built_in">print</span>(cat)
<span class="hljs-comment">// &#x6253;&#x5370;&#x51FA; &quot;&#x1F431;&quot;</span>
</code></pre>
<h2 id="&#x6574;&#x6570;">&#x6574;&#x6570;</h2>
<p>&#xA0; &#xA0; &#xA0; &#xA0; <strong>&#x6574;&#x6570;</strong> &#x662F;&#x4E0D;&#x5305;&#x62EC;&#x5C0F;&#x6570;&#x90E8;&#x5206;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x6BD4;&#x5982; <code>42</code> &#x548C; <code>-23</code>&#x3002;&#x6574;&#x6570;&#x8981;&#x4E48;&#x662F;&#x6709;&#x7B26;&#x53F7;&#x7684;&#xFF08;&#x6B63;&#x6570;&#x3001;&#x96F6;&#x6216;&#x8D1F;&#x6570;&#xFF09;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x65E0;&#x7B26;&#x53F7;&#x7684;&#xFF08;&#x6B63;&#x6570;&#x6216;&#x96F6;&#xFF09;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; Swift &#x63D0;&#x4F9B; 8 &#x4F4D;&#x3001;16 &#x4F4D;&#x3001;32 &#x4F4D;&#x4EE5;&#x53CA; 64 &#x4F4D;&#x51E0;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x6709;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x548C;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x3002;&#x8FD9;&#x4E9B;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x4E0E; C &#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x6240;&#x4EE5; 8 &#x4F4D;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x5C31;&#x662F; <code>UInt8</code>&#xFF0C;&#x800C; 32 &#x4F4D;&#x6709;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x5C31;&#x662F; <code>Int32</code>&#x3002;&#x4E0E; Swift&#x4E2D;&#x6240;&#x6709;&#x7C7B;&#x578B;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E9B;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x7684;&#x540D;&#x5B57;&#x90FD;&#x662F;&#x9996;&#x5B57;&#x6BCD;&#x5927;&#x5199;&#x7684;&#x3002;</p>
<h3 id="&#x6574;&#x6570;&#x8303;&#x56F4;">&#x6574;&#x6570;&#x8303;&#x56F4;</h3>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x901A;&#x8FC7;&#x6BCF;&#x79CD;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x7684; <code>min</code> &#x548C; <code>max</code> &#x5C5E;&#x6027;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5B83;&#x4EEC;&#x53EF;&#x8868;&#x793A;&#x8303;&#x56F4;&#x7684;&#x6700;&#x5C0F;&#x503C;&#x4E0E;&#x6700;&#x5927;&#x503C;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> minValue = <span class="hljs-type">UInt8</span>.<span class="hljs-built_in">min</span>  <span class="hljs-comment">// minValue &#x7684;&#x503C;&#x662F; 0&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x662F; UInt8</span>
<span class="hljs-keyword">let</span> maxValue = <span class="hljs-type">UInt8</span>.<span class="hljs-built_in">max</span>  <span class="hljs-comment">// maxValue &#x7684;&#x503C;&#x662F; 255&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x662F; UInt8</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x503C;&#x4E5F;&#x662F;&#x76F8;&#x5E94;&#x4F4D;&#x6570;&#x5927;&#x5C0F;&#x7684;&#x6570;&#x503C;&#xFF08;&#x6BD4;&#x5982;&#x4E0A;&#x8FF0;&#x793A;&#x4F8B;&#x7684; <code>UInt8</code>&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x4E0E;&#x5176;&#x4ED6;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x4E00;&#x901A;&#x4F7F;&#x7528;&#x3002;</p>
<h3 id="int-&#x7C7B;&#x578B;">Int &#x7C7B;&#x578B;</h3>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5728;&#x5927;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x65E0;&#x9700;&#x7CBE;&#x786E;&#x5730;&#x786E;&#x5B9A;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x3002;Swift &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x9644;&#x52A0;&#x7684;&#x6574;&#x6570;&#x7C7B;&#x578B;&#xFF1A;Int&#xFF0C;&#x5B83;&#x7684;&#x4F4D;&#x6570;&#x5927;&#x5C0F;&#x4E0E;&#x5F53;&#x524D;&#x6240;&#x5728;&#x5E73;&#x53F0;&#x73AF;&#x5883;&#x7684;&#x539F;&#x751F;&#x5B57;&#x5927;&#x5C0F;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;</p>
<ul>
<li><p>&#x5728; 32 &#x4F4D;&#x5E73;&#x53F0;&#xFF0C;<code>Int</code> &#x4E0E; <code>Int32</code> &#x62E5;&#x6709;&#x76F8;&#x540C;&#x7684;&#x4F4D;&#x6570;&#x5927;&#x5C0F;&#x3002;</p>
</li>
<li><p>&#x5728; 64 &#x4F4D;&#x5E73;&#x53F0;&#xFF0C;<code>Int</code> &#x4E0E; <code>Int64</code> &#x62E5;&#x6709;&#x76F8;&#x540C;&#x7684;&#x4F4D;&#x6570;&#x5927;&#x5C0F;&#x3002;</p>
</li>
</ul>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x9664;&#x975E;&#x4F60;&#x5F88;&#x660E;&#x786E;&#x4F60;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7279;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x6574;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x5426;&#x5219;&#x4FDD;&#x6301;&#x4F7F;&#x7528; <code>Int</code> &#x6765;&#x8868;&#x793A;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x6574;&#x6570;&#x3002;&#x8FD9;&#x6837;&#x6709;&#x5229;&#x4E8E;&#x589E;&#x5F3A;&#x4EE3;&#x7801;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x4E0E;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x3002;&#x5373;&#x4F7F;&#x5728; 32 &#x4F4D;&#x5E73;&#x53F0;&#x4E2D;&#xFF0C;<code>Int</code> &#x652F;&#x6301;&#x5B58;&#x50A8;&#x7684;&#x8303;&#x56F4;&#x4E5F;&#x662F;&#x4ECE; <code>-2,147,483,648</code> &#x5230; <code>2,147,483,647</code> &#x7684;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x6574;&#x6570;&#x8303;&#x56F4;&#x6765;&#x8BF4;&#x90FD;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x4E86;&#x3002;</p>
<h3 id="uint-&#x7C7B;&#x578B;">UInt &#x7C7B;&#x578B;</h3>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x7C7B;&#x4F3C;&#x5730;&#xFF0C;Swift &#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x4E0E;&#x5F53;&#x524D;&#x5E73;&#x53F0;&#x73AF;&#x5883;&#x539F;&#x751F;&#x5B57;&#x957F;&#x4E00;&#x81F4;&#x7684;&#x65E0;&#x7B26;&#x53F7;&#x6570;&#x7C7B;&#x578B;&#xFF1A;UInt&#xFF1A;</p>
<ul>
<li><p>&#x5728; 32 &#x4F4D;&#x5E73;&#x53F0;&#xFF0C;<code>UInt</code> &#x4E0E; <code>UInt32</code> &#x62E5;&#x6709;&#x76F8;&#x540C;&#x7684;&#x4F4D;&#x6570;&#x5927;&#x5C0F;&#x3002;</p>
</li>
<li><p>&#x5728; 64 &#x4F4D;&#x5E73;&#x53F0;&#xFF0C;<code>UInt</code> &#x4E0E; <code>UInt64</code> &#x62E5;&#x6709;&#x76F8;&#x540C;&#x7684;&#x4F4D;&#x6570;&#x5927;&#x5C0F;&#x3002;</p>
</li>
</ul>
<blockquote>
<p><em><strong>&#x8BF4;&#x660E;</strong></em></p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5F53;&#x4E14;&#x4EC5;&#x5F53;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x4E0E;&#x5E73;&#x53F0;&#x539F;&#x751F;&#x5B57;&#x957F;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#x65E0;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x65F6;&#x624D;&#x4F7F;&#x7528; <code>UInt</code> &#x7C7B;&#x578B;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;<code>Int</code> &#x66F4;&#x88AB;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#xFF0C;&#x5C3D;&#x7BA1;&#x4F60;&#x5F88;&#x660E;&#x786E;&#x8981;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x8D1F;&#x6570;&#x3002;&#x5BF9;&#x4E8E;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x4FDD;&#x6301;&#x4F7F;&#x7528; <code>Int</code> &#x53EF;&#x4EE5;&#x589E;&#x5F3A;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x79FB;&#x690D;&#x6027;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x9700;&#x8981;&#x5728;&#x4E0D;&#x540C;&#x6570;&#x503C;&#x7C7B;&#x578B;&#x95F4;&#x8F6C;&#x6362;&#xFF0C;&#x5E76;&#x4E14;&#x6EE1;&#x8DB3;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x63A8;&#x5BFC;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x8BE6;&#x89C1; <a href="#&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x4E0E;&#x7C7B;&#x578B;&#x63A8;&#x5BFC;">&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x4E0E;&#x7C7B;&#x578B;&#x63A8;&#x5BFC;</a>&#x3002;</p>
</blockquote>
<h2 id="&#x6D6E;&#x70B9;&#x6570;">&#x6D6E;&#x70B9;&#x6570;</h2>
<p>&#xA0; &#xA0; &#xA0; &#xA0; <strong>&#x6D6E;&#x70B9;&#x6570;</strong> &#x662F;&#x62E5;&#x6709;&#x5C0F;&#x6570;&#x90E8;&#x5206;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x6BD4;&#x5982; <code>3.14159</code>&#xFF0C;<code>0.1</code> &#x4EE5;&#x53CA; <code>-273.15</code>&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6D6E;&#x70B9;&#x6570;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x6BD4;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x66F4;&#x5927;&#x8303;&#x56F4;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x503C;&#x4E5F;&#x8FDC;&#x6BD4; <code>Int</code> &#x7C7B;&#x578B;&#x6570;&#x503C;&#x66F4;&#x5927;&#xFF08;&#x6216;&#x66F4;&#x5C0F;&#xFF09;&#x3002;Swift &#x63D0;&#x4F9B;&#x4E86;&#x4E24;&#x79CD;&#x6709;&#x7B26;&#x53F7;&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x7C7B;&#x578B;&#xFF1A;</p>
<ul>
<li><p><code>Double</code> &#x8868;&#x793A; 64 &#x4F4D;&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x3002;</p>
</li>
<li><p><code>Float</code> &#x8868;&#x793A; 32 &#x4F4D;&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x3002;</p>
</li>
</ul>
<blockquote>
<p><em><strong>&#x8BF4;&#x660E;</strong></em></p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; <code>Double</code> &#x62E5;&#x6709;&#x81F3;&#x5C11; 15 &#x4F4D;&#xFF08;&#x5341;&#x8FDB;&#x5236;&#xFF09;&#x7684;&#x7CBE;&#x5EA6;&#xFF0C;&#x800C; <code>Float</code> &#x62E5;&#x6709;&#x81F3;&#x5C11; 6 &#x4F4D;&#xFF08;&#x5341;&#x8FDB;&#x5236;&#xFF09;&#x7684;&#x7CBE;&#x5EA6;&#x3002;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x54EA;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x6240;&#x9700;&#x573A;&#x666F;&#x4E2D;&#x6570;&#x503C;&#x7684;&#x6027;&#x8D28;&#x4E0E;&#x8303;&#x56F4;&#x3002;&#x5982;&#x679C;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x90FD;&#x9002;&#x7528;&#xFF0C;&#x9996;&#x9009; <code>Double</code>&#x3002;</p>
</blockquote>
<h2 id="&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x4E0E;&#x7C7B;&#x578B;&#x63A8;&#x5BFC;">&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x4E0E;&#x7C7B;&#x578B;&#x63A8;&#x5BFC;</h2>
<p>&#xA0; &#xA0; &#xA0; &#xA0; Swift &#x662F;&#x4E00;&#x95E8; <strong>&#x7C7B;&#x578B;&#x5B89;&#x5168;</strong> &#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x7684;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x4EE3;&#x7801;&#x4E2D;&#x6570;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x6E05;&#x6670;&#x786E;&#x5B9A;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x4EE3;&#x7801;&#x4E2D;&#x9700;&#x8981;&#x4E00;&#x4E2A; <code>String</code> &#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4E0D;&#x5141;&#x8BB8;&#x4F20;&#x4E00;&#x4E2A; <code>Int</code> &#x7C7B;&#x578B;&#x7684;&#x503C;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5F97;&#x76CA;&#x4E8E; Swift &#x7684;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x7F16;&#x8BD1;&#x4EE3;&#x7801;&#x65F6;&#x6267;&#x884C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x5E76;&#x5C06;&#x4E0D;&#x5339;&#x914D;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4F5C;&#x4E3A;&#x7F16;&#x8BD1;&#x62A5;&#x9519;&#x6807;&#x8BC6;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x4E5F;&#x4F7F;&#x5F97;&#x53EF;&#x4EE5;&#x5728;&#x5F00;&#x53D1;&#x9636;&#x6BB5;&#x53EF;&#x4EE5;&#x5C3D;&#x65E9;&#x5730;&#x53D1;&#x73B0;&#x4E0E;&#x4FEE;&#x590D;&#x95EE;&#x9898;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x591A;&#x7C7B;&#x578B;&#x6570;&#x503C;&#x7684;&#x8BF8;&#x591A;&#x9519;&#x8BEF;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x5728;&#x58F0;&#x660E;&#x6BCF;&#x4E2A;&#x5E38;&#x91CF;&#x6216;&#x53D8;&#x91CF;&#x65F6;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x660E;&#x786E;&#x6307;&#x5B9A;&#x5B83;&#x4EEC;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5F53;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x6307;&#x5B9A;&#x6570;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x65F6;&#xFF0C;Swift &#x4F1A;&#x4F7F;&#x7528; <strong>&#x7C7B;&#x578B;&#x63A8;&#x5BFC;</strong> &#x6765;&#x786E;&#x5B9A;&#x6570;&#x503C;&#x7684;&#x5408;&#x9002;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x7C7B;&#x578B;&#x63A8;&#x5BFC;&#x4F7F;&#x5F97;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x4EC5;&#x9700;&#x6839;&#x636E;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x6570;&#x503C;&#x7C7B;&#x578B;&#xFF0C;&#x81EA;&#x52A8;&#x63A8;&#x65AD;&#x51FA;&#x76F8;&#x5E94;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4E5F;&#x6B63;&#x662F;&#x5F97;&#x76CA;&#x4E8E;&#x7C7B;&#x578B;&#x63A8;&#x5BFC;&#xFF0C;&#x76F8;&#x8F83;&#x4E8E; C &#x548C; Objective-C &#x8BED;&#x8A00;&#xFF0C;Swift &#x7684;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4EE3;&#x7801;&#x5C11;&#x5F97;&#x591A;&#x3002;&#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;&#x4F9D;&#x7136;&#x62E5;&#x6709;&#x660E;&#x786E;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x660E;&#x786E;&#x6307;&#x5B9A;&#x5B83;&#x4EEC;&#x7C7B;&#x578B;&#x7684;&#x5DE5;&#x4F5C;&#x5DF2;&#x7ECF;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#x505A;&#x597D;&#x4E86;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5F53;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x521D;&#x59CB;&#x503C;&#x7684;&#x5E38;&#x91CF;&#xFF08;&#x6216;&#x53D8;&#x91CF;&#xFF09;&#x65F6;&#xFF0C;&#x7C7B;&#x578B;&#x63A8;&#x5BFC;&#x5C31;&#x53D8;&#x5F97;&#x683C;&#x5916;&#x6709;&#x7528;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x901A;&#x5E38;&#x662F;&#x6307;&#x901A;&#x8FC7;&#x4E00;&#x4E2A; <strong>&#x5B57;&#x9762;&#x6570;&#x503C;&#xFF08;&#x6216;&#x6587;&#x672C;&#xFF09;</strong> &#x6765;&#x58F0;&#x660E;&#x5E76;&#x8D4B;&#x503C;&#x7ED9;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#xFF08;&#x6216;&#x53D8;&#x91CF;&#xFF09;&#x3002;&#xFF08;&#x5B57;&#x9762;&#x503C;&#x6307;&#x7684;&#x5C31;&#x662F;&#x4EE3;&#x7801;&#x4E2D;&#x76F4;&#x63A5;&#x8868;&#x73B0;&#x51FA;&#x6765;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x4E2D;&#x7684; <code>42</code> &#x4EE5;&#x53CA; <code>3.14159</code>&#xFF09;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x672A;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x5B57;&#x9762;&#x503C; <code>42</code> &#x8D4B;&#x503C;&#x7ED9;&#x5B83;&#xFF0C;Swift &#x5C31;&#x4F1A;&#x63A8;&#x5BFC;&#x51FA;&#x8FD9;&#x4E2A;&#x5E38;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x5E94;&#x5F53;&#x662F; <code>Int</code>&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x521D;&#x59CB;&#x6570;&#x503C;&#x5C31;&#x5982;&#x540C;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> meaningOfLife = <span class="hljs-number">42</span>
<span class="hljs-comment">// meaningOfLife &#x88AB;&#x63A8;&#x5BFC;&#x4E3A;&#x6574;&#x6570;&#x7C7B;&#x578B;</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x521D;&#x59CB;&#x5B57;&#x9762;&#x503C;&#x4E3A;&#x6D6E;&#x70B9;&#x6570;&#x503C;&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#xFF0C;&#x90A3;&#x4E48; Swift &#x4F1A;&#x5C06;&#x5176;&#x63A8;&#x5BFC;&#x4E3A; <code>Double</code> &#x7C7B;&#x578B;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> pi = <span class="hljs-number">3.14159</span>
<span class="hljs-comment">// pi &#x88AB;&#x63A8;&#x5BFC;&#x4E3A;&#x53CC;&#x7CBE;&#x5EA6;&#x6D6E;&#x70B9;&#x6570;&#xFF08;Double &#x7C7B;&#x578B;&#xFF09;</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF0C;Swift &#x603B;&#x662F;&#x4F1A;&#x4F7F;&#x7528; <code>Double</code>&#xFF08;&#x800C;&#x975E; <code>Float</code>&#xFF09;&#x7C7B;&#x578B;&#x6765;&#x4F5C;&#x4E3A;&#x6D6E;&#x70B9;&#x5B57;&#x9762;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x63A8;&#x5BFC;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5982;&#x679C;&#x662F;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x4E0E;&#x6D6E;&#x70B9;&#x6570;&#x5B57;&#x9762;&#x503C;&#x7684;&#x52A0;&#x6CD5;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x90A3;&#x4E48;&#x8868;&#x8FBE;&#x5F0F;&#x7ED3;&#x679C;&#x7684;&#x6570;&#x503C;&#x7C7B;&#x578B;&#x4E5F;&#x4F1A;&#x63A8;&#x5BFC;&#x4E3A; <code>Double</code>&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> anotherPi = <span class="hljs-number">3</span> + <span class="hljs-number">0.14159</span>
<span class="hljs-comment">// anotherPi &#x4E5F;&#x88AB;&#x63A8;&#x5BFC;&#x4E3A;&#x53CC;&#x7CBE;&#x5EA6;&#x6D6E;&#x70B9;&#x6570;&#xFF08;Double &#x7C7B;&#x578B;&#xFF09;</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5B57;&#x9762;&#x503C; <code>3</code> &#x6CA1;&#x6709;&#x663E;&#x5F0F;&#x786E;&#x5B9A;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x6240;&#x4EE5;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x7684;&#x6D6E;&#x70B9;&#x5B57;&#x9762;&#x503C;&#x4F7F;&#x5F97; <code>Double</code> &#x4F5C;&#x4E3A;&#x63A8;&#x5BFC;&#x7ED3;&#x679C;&#x66F4;&#x52A0;&#x5408;&#x9002;&#x3002;</p>
<h2 id="&#x6570;&#x503C;&#x578B;&#x5B57;&#x9762;&#x503C;">&#x6570;&#x503C;&#x578B;&#x5B57;&#x9762;&#x503C;</h2>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6570;&#x503C;&#x578B;&#x5B57;&#x9762;&#x503C;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x5199;&#x4F5C;&#x4EE5;&#x4E0B;&#x5F62;&#x5F0F;&#xFF1A;</p>
<ul>
<li>&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x524D;&#x7F00;&#x7684; <strong>&#x5341;&#x8FDB;&#x5236;</strong> &#x5B57;&#x9762;&#x503C;</li>
<li>&#x4F7F;&#x7528; <code>0b</code> &#x4F5C;&#x4E3A;&#x524D;&#x7F00;&#x7684; <strong>&#x4E8C;&#x8FDB;&#x5236;</strong> &#x5B57;&#x9762;&#x503C;</li>
<li>&#x4F7F;&#x7528; <code>0o</code> &#x4F5C;&#x4E3A;&#x524D;&#x7F00;&#x7684; <strong>&#x516B;&#x8FDB;&#x5236;</strong> &#x5B57;&#x9762;&#x503C;</li>
<li>&#x4F7F;&#x7528; <code>0x</code> &#x4F5C;&#x4E3A;&#x524D;&#x7F00;&#x7684; <strong>&#x5341;&#x516D;&#x8FDB;&#x5236;</strong> &#x5B57;&#x9762;&#x503C;</li>
</ul>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5341;&#x8FDB;&#x5236;&#x5B57;&#x9762;&#x503C; <code>17</code> &#x53EF;&#x4EE5;&#x5199;&#x4F5C;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> decimalInteger = <span class="hljs-number">17</span>
<span class="hljs-keyword">let</span> binaryInteger = <span class="hljs-number">0b10001</span>       <span class="hljs-comment">// &#x4E8C;&#x8FDB;&#x5236;&#x7684; 17</span>
<span class="hljs-keyword">let</span> octalInteger = <span class="hljs-number">0o21</span>           <span class="hljs-comment">// &#x516B;&#x8FDB;&#x5236;&#x7684; 17</span>
<span class="hljs-keyword">let</span> hexadecimalInteger = <span class="hljs-number">0x11</span>     <span class="hljs-comment">// &#x5341;&#x516D;&#x8FDB;&#x5236;&#x7684; 17</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6D6E;&#x70B9;&#x6570;&#x5B57;&#x9762;&#x503C;&#x53EF;&#x4EE5;&#x662F;&#x5341;&#x8FDB;&#x5236;&#xFF08;&#x65E0;&#x524D;&#x7F00;&#xFF09;&#xFF0C;&#x6216;&#x5341;&#x516D;&#x8FDB;&#x5236;&#xFF08;&#x524D;&#x7F00;&#x4E3A; <code>0x</code>&#xFF09;&#x3002;&#x5B83;&#x4EEC;&#x90FD;&#x5FC5;&#x987B;&#x5728;&#x5C0F;&#x6570;&#x70B9;&#x7684;&#x4E24;&#x8FB9;&#x62E5;&#x6709;&#x6570;&#x503C;&#xFF08;&#x6216;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x5B57;&#x7B26;&#xFF09;&#x3002;&#x5341;&#x8FDB;&#x5236;&#x6D6E;&#x70B9;&#x6570;&#x5B57;&#x9762;&#x503C;&#x4E5F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6027;&#x5730;&#x52A0;&#x4E0A; <strong>&#x6307;&#x6570;</strong>&#xFF0C;&#x6307;&#x6570;&#x4F7F;&#x7528;&#x5927;&#x5199;&#x6216;&#x5C0F;&#x5199;&#x7684; <code>e</code> &#x6765;&#x8868;&#x793A;&#xFF1B;&#x800C;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x5B57;&#x9762;&#x503C;&#x5219;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E2A;&#x6307;&#x6570;&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x6307;&#x6570;&#x4F7F;&#x7528;&#x5927;&#x5199;&#x6216;&#x5C0F;&#x5199;&#x7684; <code>p</code> &#x6765;&#x8868;&#x793A;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5BF9;&#x4E8E;&#x6307;&#x6570;&#x4E3A; <code>exp</code> &#x7684;&#x5341;&#x8FDB;&#x5236;&#x6570;&#x503C;&#xFF0C;&#x57FA;&#x6570;&#x9700;&#x8981;&#x4E58;&#x4EE5; 10<sup>exp</sup>&#xFF1A;</p>
<ul>
<li><code>1.25e2</code> &#x8868;&#x793A; 1.25 x 10<sup>2</sup>&#xFF0C;&#x6216;&#x8005; <code>125.0</code>&#x3002;</li>
<li><code>1.25e-2</code> &#x8868;&#x793A; 1.25 x 10<sup>-2</sup>&#xFF0C;&#x6216;&#x8005; <code>0.0125</code>&#x3002;</li>
</ul>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5BF9;&#x4E8E;&#x6307;&#x6570;&#x4E3A; <code>exp</code> &#x7684;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x503C;&#xFF0C;&#x57FA;&#x6570;&#x9700;&#x8981;&#x4E58;&#x4EE5; 2<sup>exp</sup>&#xFF1A;</p>
<ul>
<li><code>0xFp2</code> &#x8868;&#x793A; 15 x 2<sup>2</sup>&#xFF0C;&#x6216;&#x8005; <code>60.0</code>&#x3002;</li>
<li><code>0xFp-2</code> &#x8868;&#x793A; 15 x 2<sup>-2</sup>&#xFF0C;&#x6216;&#x8005; <code>3.75</code>&#x3002;</li>
</ul>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4EE5;&#x4E0B;&#x6D6E;&#x70B9;&#x6570;&#x5B57;&#x9762;&#x503C;&#x5747;&#x8868;&#x793A;&#x5341;&#x8FDB;&#x5236;&#x6570;&#x503C; <code>12.1875</code>&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> decimalDouble = <span class="hljs-number">12.1875</span>
<span class="hljs-keyword">let</span> exponentDouble = <span class="hljs-number">1.21875e1</span>
<span class="hljs-keyword">let</span> hexadecimalDouble = <span class="hljs-number">0xC.3p0</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6570;&#x503C;&#x578B;&#x5B57;&#x9762;&#x503C;&#x4E5F;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x9644;&#x52A0;&#x7684;&#x683C;&#x5F0F;&#x5316;&#x5B57;&#x7B26;&#x6765;&#x63D0;&#x9AD8;&#x5B83;&#x4EEC;&#x7684;&#x6613;&#x8BFB;&#x6027;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x6574;&#x6570;&#x8FD8;&#x662F;&#x6D6E;&#x70B9;&#x6570;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x586B;&#x5145;&#x989D;&#x5916;&#x7684;&#x96F6;&#x4EE5;&#x53CA;&#x4E0B;&#x5212;&#x7EBF;&#x6765;&#x63D0;&#x9AD8;&#x53EF;&#x8BFB;&#x6027;&#x3002;&#x4EFB;&#x4F55;&#x7528;&#x4E8E;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x5B57;&#x7B26;&#x90FD;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5B57;&#x9762;&#x503C;&#x6240;&#x8868;&#x793A;&#x7684;&#x5B9E;&#x9645;&#x6570;&#x503C;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> paddedDouble = <span class="hljs-number">000123.456</span>
<span class="hljs-keyword">let</span> oneMillion = <span class="hljs-number">1_000_000</span>
<span class="hljs-keyword">let</span> justOverOneMillion = <span class="hljs-number">1_000_000.000_000_1</span>
</code></pre>
<h2 id="&#x6570;&#x503C;&#x7C7B;&#x578B;&#x95F4;&#x8F6C;&#x6362;">&#x6570;&#x503C;&#x7C7B;&#x578B;&#x95F4;&#x8F6C;&#x6362;</h2>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5728;&#x7F16;&#x7801;&#x65F6;&#xFF0C;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x5E38;&#x89C1;&#x7684;&#x6574;&#x6570;&#x9700;&#x6C42;&#x573A;&#x666F;&#xFF0C;&#x5C3D;&#x7BA1;&#x660E;&#x786E;&#x6240;&#x9700;&#x6570;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x8D1F;&#x6570;&#xFF0C;&#x90FD;&#x4F7F;&#x7528; <code>Int</code> &#x7C7B;&#x578B;&#x3002;&#x5728;&#x4EFB;&#x4F55;&#x573A;&#x666F;&#x4E0B;&#x90FD;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x7684;&#x6574;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x5C31;&#x610F;&#x5473;&#x7740;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x7684;&#x5E38;&#x91CF;&#x4E0E;&#x53D8;&#x91CF;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x5FEB;&#x901F;&#x5730;&#x8F6C;&#x6362;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x5339;&#x914D;&#x6574;&#x6570;&#x578B;&#x5B57;&#x9762;&#x503C;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4EC5;&#x5F53;&#x624B;&#x5934;&#x7684;&#x4EFB;&#x52A1;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x6574;&#x6570;&#x65F6;&#x624D;&#x4F7F;&#x7528;&#xFF0C;&#x6B64;&#x65F6;&#x53EF;&#x80FD;&#x662F;&#x4E3A;&#x4E86;&#x9002;&#x914D;&#x5916;&#x90E8;&#x6E90;&#x7801;&#x7684;&#x56FA;&#x5B9A;&#x6570;&#x503C;&#x5927;&#x5C0F;&#x3001;&#x6216;&#x662F;&#x4E3A;&#x4E86;&#x6027;&#x80FD;&#x3001;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x7684;&#x5FC5;&#x8981;&#x4F18;&#x5316;&#x3002;&#x8FD9;&#x4E9B;&#x573A;&#x666F;&#x4E0B;&#x4F7F;&#x7528;&#x7279;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6355;&#x83B7;&#x610F;&#x5916;&#x7684;&#x6570;&#x503C;&#x6EA2;&#x51FA;&#xFF0C;&#x4EE5;&#x53CA;&#x9690;&#x5F0F;&#x5730;&#x8BB0;&#x5F55;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x7684;&#x7279;&#x6027;&#x3002;</p>
<h3 id="&#x6574;&#x6570;&#x95F4;&#x8F6C;&#x6362;">&#x6574;&#x6570;&#x95F4;&#x8F6C;&#x6362;</h3>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x503C;&#x7C7B;&#x578B;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x4EEC;&#x6240;&#x80FD;&#x5B58;&#x50A8;&#x5E38;&#x91CF;&#xFF08;&#x6216;&#x53D8;&#x91CF;&#xFF09;&#x6570;&#x503C;&#x8303;&#x56F4;&#x4E5F;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;<code>Int8</code> &#x7C7B;&#x578B;&#x7684;&#x5E38;&#x91CF;&#xFF08;&#x6216;&#x53D8;&#x91CF;&#xFF09;&#x80FD;&#x5B58;&#x50A8;&#x6570;&#x503C;&#x7684;&#x8303;&#x56F4;&#x662F; <code>-128</code> &#x5230; <code>127</code>&#xFF0C;&#x800C; <code>UInt8</code> &#x7684;&#x5E38;&#x91CF;&#xFF08;&#x6216;&#x53D8;&#x91CF;&#xFF09;&#x6240;&#x80FD;&#x5B58;&#x50A8;&#x7684;&#x8303;&#x56F4;&#x662F; <code>0</code> &#x5230; <code>255</code>&#x3002;&#x5F53;&#x6307;&#x5B9A;&#x6570;&#x503C;&#x4E0D;&#x5728;&#x6570;&#x503C;&#x7C7B;&#x578B;&#x6240;&#x80FD;&#x5B58;&#x50A8;&#x7684;&#x8303;&#x56F4;&#x5185;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x671F;&#x62A5;&#x9519;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> cannotBeNegative: <span class="hljs-type">UInt8</span> = -<span class="hljs-number">1</span>
<span class="hljs-comment">// UInt8 &#x7C7B;&#x578B;&#x4E0D;&#x80FD;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x8D1F;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x4F1A;&#x62A5;&#x9519;</span>
<span class="hljs-keyword">let</span> tooBig: <span class="hljs-type">Int8</span> = <span class="hljs-type">Int8</span>.<span class="hljs-built_in">max</span> + <span class="hljs-number">1</span>
<span class="hljs-comment">// Int8 &#x4E0D;&#x80FD;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x6BD4;&#x5B83;&#x6240;&#x80FD;&#x8868;&#x793A;&#x7684;&#x6700;&#x5927;&#x503C;&#x8FD8;&#x8981;&#x5927;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x4E5F;&#x4F1A;&#x62A5;&#x9519;</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x7531;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x503C;&#x7C7B;&#x578B;&#x6240;&#x80FD;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x503C;&#x8303;&#x56F4;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x5FC5;&#x987B;&#x8981;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x6765;&#x786E;&#x5B9A;&#x6570;&#x503C;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x3002;&#x8FD9;&#x79CD;&#x786E;&#x5B9A;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#x907F;&#x514D;&#x4E86;&#x9690;&#x5F0F;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x8BA9;&#x4EE3;&#x7801;&#x4E2D;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x7684;&#x610F;&#x56FE;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x4E3A;&#x4E86;&#x5C06;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x4E3A;&#x53E6;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x73B0;&#x6709;&#x7684;&#x8FD9;&#x4E2A;&#x6570;&#x503C;&#x6765;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x76EE;&#x6807;&#x7C7B;&#x578B;&#x6570;&#x503C;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5E38;&#x91CF; <code>twoThousand</code> &#x7684;&#x7C7B;&#x578B;&#x662F; <code>UInt16</code>&#xFF0C;&#x800C;&#x5E38;&#x91CF; <code>one</code> &#x7684;&#x7C7B;&#x578B;&#x662F; <code>UInt8</code>&#x3002;&#x7531;&#x4E8E;&#x5B83;&#x4EEC;&#x7684;&#x7C7B;&#x578B;&#x4E0D;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x5E76;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x76F8;&#x52A0;&#x3002;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#xFF0C;&#x793A;&#x4F8B;&#x4E2D;&#x4F7F;&#x7528; <code>UInt16(one)</code> &#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x62E5;&#x6709; <code>one</code> &#x5B9E;&#x9645;&#x503C;&#x7684;&#x65B0;&#x7684; <code>UInt16</code> &#x7C7B;&#x578B;&#x6570;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x8FD9;&#x4E2A;&#x503C;&#x6765;&#x53D6;&#x4EE3;&#x539F;&#x6765;&#x7684;&#x6570;&#x503C;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> twoThousand: <span class="hljs-type">UInt16</span> = <span class="hljs-number">2_000</span>
<span class="hljs-keyword">let</span> one: <span class="hljs-type">UInt8</span> = <span class="hljs-number">1</span>
<span class="hljs-keyword">let</span> twoThousandAndOne = twoThousand + <span class="hljs-type">UInt16</span>(one)
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6B64;&#x65F6;&#x52A0;&#x6CD5;&#x8868;&#x8FBE;&#x5F0F;&#x4E24;&#x8FB9;&#x90FD;&#x662F; <code>UInt16</code> &#x7C7B;&#x578B;&#x6570;&#x503C;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x52A0;&#x6CD5;&#x64CD;&#x4F5C;&#x5C31;&#x88AB;&#x5141;&#x8BB8;&#x4E86;&#x3002;&#x7531;&#x4E8E;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x5E38;&#x91CF;&#xFF08;<code>twoThousand</code>&#xFF09;&#x662F;&#x4E24;&#x4E2A; <code>UInt16</code> &#x7C7B;&#x578B;&#x6570;&#x503C;&#x52A0;&#x6CD5;&#x8BA1;&#x7B97;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x4E5F;&#x88AB;&#x63A8;&#x5BFC;&#x4E3A; <code>UInt16</code>&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; <code>SomeType(ofInitialValue)</code> &#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x521D;&#x59CB;&#x503C;&#x6765;&#x8C03;&#x7528;&#x4E00;&#x4E2A; Swift &#x7C7B;&#x6784;&#x9020;&#x5668;&#x7684;&#x9ED8;&#x8BA4;&#x65B9;&#x5F0F;&#x3002;&#x6B63;&#x662F;&#x5728;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#x4E0B;&#xFF0C;<code>UInt16</code> &#x7C7B;&#x578B;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x63A5;&#x53D7; <code>UInt8</code> &#x7C7B;&#x578B;&#x6570;&#x503C;&#x7684;&#x6784;&#x9020;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x73B0;&#x6709;&#x7684; <code>UInt8</code> &#x7C7B;&#x578B;&#x6570;&#x503C;&#x6765;&#x8C03;&#x7528;&#x6784;&#x9020;&#x5668;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684; <code>UInt16</code> &#x7C7B;&#x578B;&#x6570;&#x503C;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x4EFB;&#x610F;&#x7C7B;&#x578B;&#x90FD;&#x80FD;&#x8FBE;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E; <code>UInt16</code> &#x63D0;&#x4F9B;&#x54EA;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6784;&#x9020;&#x5668;&#x3002;&#x6269;&#x5C55;&#x73B0;&#x6709;&#x7C7B;&#x578B;&#x6765;&#x63D0;&#x4F9B;&#x53EF;&#x63A5;&#x53D7;&#x65B0;&#x7C7B;&#x578B;&#xFF08;&#x751A;&#x81F3;&#x662F;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#xFF09;&#x7684;&#x6784;&#x9020;&#x5668;&#xFF0C;&#x8BE6;&#x60C5;&#x53EF;&#x53C2;&#x8003; <a href="#&#x6269;&#x5C55;">&#x6269;&#x5C55;</a>&#x3002;</p>
<h3 id="&#x6574;&#x6570;&#x4E0E;&#x6D6E;&#x70B9;&#x6570;&#x95F4;&#x8F6C;&#x6362;">&#x6574;&#x6570;&#x4E0E;&#x6D6E;&#x70B9;&#x6570;&#x95F4;&#x8F6C;&#x6362;</h3>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6574;&#x6570;&#x4E0E;&#x6D6E;&#x70B9;&#x6570;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x503C;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x5FC5;&#x987B;&#x663E;&#x5F0F;&#x8FDB;&#x884C;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> three = <span class="hljs-number">3</span>
<span class="hljs-keyword">let</span> pointOneFourOneFiveNine = <span class="hljs-number">0.14159</span>
<span class="hljs-keyword">let</span> pi = <span class="hljs-type">Double</span>(three) + pointOneFourOneFiveNine
<span class="hljs-comment">// pi &#x7B49;&#x4E8E; 3.14159&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x88AB;&#x63A8;&#x5BFC;&#x4E3A; Double</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x8FD9;&#x91CC;&#xFF0C;&#x5E38;&#x91CF; <code>three</code> &#x7684;&#x6570;&#x503C;&#x88AB;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x4E3A; <code>Double</code> &#x7684;&#x65B0;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x52A0;&#x6CD5;&#x8868;&#x8FBE;&#x5F0F;&#x4E24;&#x4FA7;&#x6570;&#x503C;&#x662F;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x4E86;&#x3002;&#x5982;&#x679C;&#x6B64;&#x5904;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#xFF0C;&#x90A3;&#x4E48;&#x52A0;&#x6CD5;&#x64CD;&#x4F5C;&#x4E5F;&#x662F;&#x4E0D;&#x5141;&#x8BB8;&#x6267;&#x884C;&#x7684;&#x3002;</p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6D6E;&#x70B9;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x4E3A;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x7684;&#x64CD;&#x4F5C;&#x4E5F;&#x5FC5;&#x987B;&#x662F;&#x663E;&#x5F0F;&#x7684;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A; <code>Double</code> &#x7C7B;&#x578B;&#x6216; <code>Float</code> &#x7C7B;&#x578B;&#x7684;&#x6570;&#x503C;&#x6765;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#xFF1A;</p>
<pre><code class="lang-swift"><span class="hljs-keyword">let</span> integerPi = <span class="hljs-type">Int</span>(pi)
<span class="hljs-comment">// integerPi &#x7B49;&#x4E8E; 3&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x88AB;&#x63A8;&#x5BFC;&#x4E3A; Int</span>
</code></pre>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4E0B;&#xFF0C;&#x7528;&#x4E8E;&#x521D;&#x59CB;&#x5316;&#x6574;&#x6570;&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x4F1A;&#x88AB;&#x622A;&#x65AD;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;<code>4.751</code> &#x53D8;&#x6210; <code>4</code>&#xFF0C;&#x800C; <code>-3.9</code> &#x53D8;&#x6210; <code>-3</code>&#x3002;</p>
<blockquote>
<p><em><strong>&#x8BF4;&#x660E;</strong></em></p>
<p>&#xA0; &#xA0; &#xA0; &#xA0; &#x6570;&#x503C;&#x578B;&#x5E38;&#x91CF;&#x53CA;&#x53D8;&#x91CF;&#x7684;&#x8BA1;&#x7B97;&#x89C4;&#x5219;&#x4E0E;&#x6570;&#x503C;&#x578B;&#x5B57;&#x9762;&#x503C;&#x7684;&#x89C4;&#x5219;&#x5E76;&#x4E0D;&#x76F8;&#x540C;&#x3002;&#x5B57;&#x9762;&#x503C; 3 &#x53EF;&#x4EE5;&#x4E0E;&#x5B57;&#x9762;&#x503C; 0.14159 &#x76F4;&#x63A5;&#x76F8;&#x52A0;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6570;&#x503C;&#x578B;&#x5B57;&#x9762;&#x503C;&#x672C;&#x8EAB;&#x5E76;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x7C7B;&#x578B;&#x4EC5;&#x5728;&#x7F16;&#x8BD1;&#x5668;&#x5904;&#x7406;&#x5230;&#x65F6;&#x624D;&#x4F1A;&#x88AB;&#x63A8;&#x5BFC;&#x786E;&#x5B9A;&#x3002;</p>
</blockquote>

						
					</section>
					
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

				</div>
			</div>
			
		</div>

		
		
		<a href="./"
			class="navigation navigation-prev "
			aria-label="Previous page: 语法教程">
			<i class="fa fa-angle-left"></i>
		</a>
		
		
		<a href="../LanguageReference/"
			class="navigation navigation-next "
			aria-label="Next page: 参考引用">
			<i class="fa fa-angle-right"></i>
		</a>
		
		
		
	</div>
	<script>
		var gitbook = gitbook || [];
		gitbook.push(function () {
			gitbook.page.hasChanged({"page":{"title":"基础内容","level":"1.3.1","depth":2,"next":{"title":"参考引用","level":"1.4","depth":1,"path":"LanguageReference/README.md","ref":"LanguageReference/README.md","articles":[]},"previous":{"title":"语法教程","level":"1.3","depth":1,"path":"LanguageGuide/README.md","ref":"LanguageGuide/README.md","articles":[{"title":"基础内容","level":"1.3.1","depth":2,"path":"LanguageGuide/TheBasics.md","ref":"LanguageGuide/TheBasics.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","-sharing","-fontsettings","search-pro","code","back-to-top-button","cuav-chapters","theme-canyon"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"theme-canyon":{"search-placeholder":"🔍  输入搜索内容…"},"search-pro":{},"code":{"copyButtons":true},"back-to-top-button":{},"cuav-chapters":{"summaryMaxSize":20,"useLimitExpanded":false},"highlight":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"modnarshen","lang":"zh-cn","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Swift 编程语言","gitbook":"*","description":"Swift 编程语言"},"file":{"path":"LanguageGuide/TheBasics.md","mtime":"2022-10-06T16:07:19.239Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-07T11:00:15.585Z"},"basePath":"..","book":{"language":""}});
		});
	</script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-cuav-chapters/cuav-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-canyon/canyon.js"></script>
        
    

    </body>
</html>

